{
	"@metadata": {
		"authors": [
			"Liuxinyu970226",
			"Nemo bis",
			"Tim Starling",
			"Umherirrender"
		]
	},
	"parsermigration-desc": "{{desc|name=ParserMigration}}",
	"parsermigration-edit-subtitle": "A subtitle shown below the h1 when editing a page with the tool",
	"parsermigration-current": "Adjective. The column heading for the article HTML as shown by the current parser.\n{{Identical|Current}}",
	"parsermigration-new": "The column heading for the article HTML as shown by the \"new\" parser\n{{Identical|New}}",
	"parsermigration-pref-label": "The user preference label for a checkbox which enables the feature",
	"parsermigration-pref-help": "Help text for the user preference checkbox",
	"parsermigration-toolbox-label": "The text of the toolbox link, which allows the user to edit the page with a special user interface.",
	"parsermigration-parsoid-readviews-selector-label": "The user preference label for drop-down selector which allows opt-in, opt-out, or the use of the wiki default setting for the use of the new Parsoid parser",
	"parsermigration-parsoid-readviews-selector-help": "Help text for the user preference drop-down selector for the use of the new Parsoid parser",
	"parsermigration-parsoid-readviews-always": "Selector text used when the user wants to always use the new Parsoid parser to render wikitext",
	"parsermigration-parsoid-readviews-default": "Selector text used when the user wants to follow the wiki default preferences for the use of the Parsoid parser to render wikitext",
	"parsermigration-parsoid-readviews-never": "Selector text used when the user wants to never use the new Parsoid parser to render wikitext",
	"parsermigration-use-legacy-parser-toolbox-label": "The text of the toolbox link which allows the user to use the legacy parser to render this page",
	"parsermigration-use-parsoid-toolbox-label": "The text of the toolbox link which allows the user to use the Parsoid parser to render this page",
	"parsermigration-notice-title": "Title text for a notification displayed when a user views a page rendered with the Parsoid wikitext parser for the first time.",
	"parsermigration-notice-body": "Body text for a notification displayed when a user views a page rendered with the Parsoid wikitext parser for the first time.",
	"parsermigration-parsoid-chip-label": "Short text for an indicator at the top of an article page marking a page that has been rendered with the new Parsoid wikitext parser."
}
