{
	"@metadata": {
		"authors": [
			"Amire80",
			"C. Scott Ananian",
			"Liuxinyu970226",
			"Nemo bis",
			"Tim Starling",
			"Umherirrender"
		]
	},
	"parsermigration-desc": "{{desc|name=ParserMigration}}",
	"parsermigration-edit-subtitle": "A subtitle shown below the h1 when editing a page with the tool",
	"parsermigration-current": "Adjective. The column heading for the article HTML as shown by the current parser.\n{{Identical|Current}}",
	"parsermigration-new": "The column heading for the article HTML as shown by the \"new\" parser\n{{Identical|New}}",
	"parsermigration-pref-label": "The user preference label for a checkbox which enables the feature",
	"parsermigration-pref-help": "Help text for the user preference checkbox",
	"parsermigration-toolbox-label": "The text of the toolbox link, which allows the user to edit the page with a special user interface.",
	"parsermigration-parsoid-readviews-selector-label": "The user preference label for drop-down selector which allows opt-in, opt-out, or the use of the wiki default setting for the use of the new Parsoid parser",
	"parsermigration-parsoid-readviews-selector-help": "Help text for the user preference drop-down selector for the use of the new Parsoid parser",
	"parsermigration-parsoid-readviews-always": "Selector text used when the user wants to always use the new Parsoid parser to render wikitext",
	"parsermigration-parsoid-readviews-default": "Selector text used when the user wants to follow the wiki default preferences for the use of the Parsoid parser to render wikitext",
	"parsermigration-parsoid-readviews-never": "Selector text used when the user wants to never use the new Parsoid parser to render wikitext",
	"parsermigration-use-legacy-parser-toolbox-label": "The text of the toolbox link which allows the user to use the legacy parser to render this page",
	"parsermigration-use-parsoid-toolbox-label": "The text of the toolbox link which allows the user to use the Parsoid parser to render this page",
	"parsermigration-report-bug-toolbox-label": "The text of the toolbox link that allows the user to report a visual bug with the rendering of the page",
	"parsermigration-report-bug-toolbox-title": "The tool tip for the toolbox link that allows the user to report a visual bug with the rendering of the page",
	"parsermigration-notice-title": "Title text for a notification displayed when a user views a page rendered with the Parsoid wikitext parser for the first time.",
	"parsermigration-notice-body": "Body text for a notification displayed when a user views a page rendered with the Parsoid wikitext parser for the first time.",
	"parsermigration-parsoid-chip-label": "Short text for an indicator at the top of a main space page marking a page that has been rendered with the new Parsoid wikitext parser.",
	"parsermigration-reportbug-dialog-cancel-button-label": "Label for the button which closes the \"Report Visual Bug\" dialog\n{{Identical|Cancel}}",
	"parsermigration-reportbug-dialog-complete-message": "Thanks message, appears if submission of the report was successful. Parameters:\n* $1 - Feedback page title\n* $2 - Feedback page URL",
	"parsermigration-reportbug-dialog-complete-title": "The title of the \"Report Visual Bug\" dialog after successful submission of the report\n{{Identical|Thank you}}",
	"parsermigration-reportbug-dialog-desc": "Descriptive text at the top of the dialog box for \"Report Visual Bug\" feature",
	"parsermigration-reportbug-dialog-destination": "Description of the page where the message created by the \"Report Visual Bug\" dialog will be posted. Parameters:\n* $1 - Feedback page title\n* $2 - Feedback page URL",
	"parsermigration-reportbug-dialog-done-button-label": "Label for the button which closes the \"Report Visual Bug\" dialog upon successful submission of the report\n{{Identical|Done}}",
	"parsermigration-reportbug-dialog-error-label": "Label for the error message shown when the report can not be submitted",
	"parsermigration-reportbug-dialog-message-label": "Label for the text field showing the body of the message created by the \"Report Visual Bug\" dialog; this also shows the current page and revision. Parameters:\n* $1 - Current page title\n* $2 - Current page revision",
	"parsermigration-reportbug-dialog-placeholder": "Placeholder text in the \"Report Visual Bug\" dialog",
	"parsermigration-reportbug-dialog-progress": "Label for the progress spinner after submission of a report",
	"parsermigration-reportbug-dialog-retry-button-label": "Label for the button which submits the \"Report Visual Bug\" dialog after an error\n{{Identical|Retry}}",
	"parsermigration-reportbug-dialog-submit-button-label": "Label for the button which submits the \"Report Visual Bug\" dialog\n{{Identical|Submit}}",
	"parsermigration-reportbug-dialog-title": "Title of the dialog box for \"Report Visual Bug\" feature",
	"parsermigration-reportbug-feedback-title": "{{Optional}}\nA title of a page on a local wiki where users can leave feedback using the \"Report Visual Bug\" feature. (This feature is not necessarily enabled; depending on the wiki's configuration, the issues may also be reported to a page on a central wiki in a wiki family.)",
	"parsermigration-feedback-error1": "{{Identical|feedback-error1}}",
	"parsermigration-feedback-error4": "{{Identical|feedback-error4}}",
	"tag-parsermigration-visual-bug": "Change tag for reports created by the \"Report Visual Bug\" feature",
	"tag-parsermigration-visual-bug-description": "Description for the <code>parsermigration-visual-bug</code> change tag"
}
